<a href="https://colab.research.google.com/github/pedroblossbraga/JSON_handling/blob/main/JSON_to_CSV_converter_Py.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [87]:
import json


d = {
    'a': [1,2,3],
     'b': ['alex', 'bert', 'cam'],
     'c': [0],
     'd': list(range(10))
}

j = json.dumps(d)
j

'{"a": [1, 2, 3], "b": ["alex", "bert", "cam"], "c": [0], "d": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]}'

In [88]:
import pandas as pd
import json

def JSON_to_str(j):
  """
  Converts a JSON to a DataFrame table

  -------------------------
  Parameters
  j: JSON

  Returns
  df: DataFrame
  ---------------------------
  """
  l = j.replace('}','').replace('}','').split(']')
  l = list(filter(lambda x: x!= '',l))

  di = {}
  N = 0
  for k in range(len(l)):
    chave, vals = l[k].split(':')
    z = vals.replace(' ','').replace('[','').replace('"','').split(',')
    if len(z)>N:
      N = len(z) # largest sequence size in JSON
    di.update(
        {
            chave.replace('{','').replace('}','').replace('"','').replace(' ','').replace(',','') : z
        }
    )

  for k in list(di.keys()):
    N_k = len(di[k])
    di[k]+= ['']*(N - N_k)

  df = pd.DataFrame(
      data=di, columns = list(di.keys()),
      index = list(range(N))
  )
  return df

df = JSON_to_str(j)
df

   a     b  c  d
0  1  alex  0  0
1  2  bert     1
2  3   cam     2
3              3
4              4
5              5
6              6
7              7
8              8
9              9